package cloud.ry.day15num190;
//颠倒给定的 32 位无符号整数的二进制位。
//
// 提示： 
//
// 
// 请注意，在某些语言（如 Java）中，没有无符号整数类型。在这种情况下，输入和输出都将被指定为有符号整数类型，并且不应影响您的实现，因为无论整数是有符号的
//还是无符号的，其内部的二进制表示形式都是相同的。 
// 在 Java 中，编译器使用二进制补码记法来表示有符号整数。因此，在 示例 2 中，输入表示有符号整数 -3，输出表示有符号整数 -1073741825。
// 
// 
//
// 
//
// 示例 1： 
//
// 
//输入：n = 00000010100101000001111010011100
//输出：964176192 (00111001011110000010100101000000)
//解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
//     因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。 
//
// 示例 2： 
//
// 
//输入：n = 11111111111111111111111111111101
//输出：3221225471 (10111111111111111111111111111111)
//解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
//     因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。 
//
// 
//
// 提示： 
//
// 
// 输入是一个长度为 32 的二进制字符串 
// 
//
// 
//
// 进阶: 如果多次调用这个函数，你将如何优化你的算法？ 
// Related Topics 位运算 分治 👍 524 👎 0

import java.util.BitSet;

public class num190ReverseBits_bitset {
    public static void main(String[] args) {
        Solution solution = new num190ReverseBits_bitset().new Solution();
    }

    //leetcode submit region begin(Prohibit modification and deletion)
    public class Solution {
        // you need treat n as an unsigned value
        public int reverseBits(int n) {
            BitSet bitSet = new BitSet(32);
            for (int i = 0; i < 32; i++) {
                if (((n >>> i) & 1) == 1) {
                    bitSet.set(i);
                }
            }
            int midIndex = 15;
            while (midIndex >= 0) {
                swap(bitSet, midIndex, 31 - midIndex);
                midIndex--;
            }
            int ret = 0;
            for (int i = 0; i < 32; i++) {
                // ret |=  == ret +=
                ret |= bitSet.get(i) ? 1 << i : 0;
            }
            return ret;
        }

        public void swap(BitSet bitSet, int a, int b) {
            boolean aValue = bitSet.get(a);
            boolean bValue = bitSet.get(b);
            // aValue =true, set b位位1, 否则为0
            bitSet.set(b, aValue);
            bitSet.set(a, bValue);
        }
    }
//leetcode submit region end(Prohibit modification and deletion)

}